; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-8-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-4 - location
	p0-10 - location
	p1-3 - location
	p1-9 - location
	p2-1 - location
	p2-7 - location
	p2-11 - location
	p3-12 - location
	p4-1 - location
	p4-11 - location
	p4-12 - location
	p6-2 - location
	p6-5 - location
	p6-7 - location
	p6-11 - location
	p8-0 - location
	p8-5 - location
	p9-3 - location
	p9-8 - location
	p10-3 - location
	p10-11 - location
	p11-7 - location
	p12-6 - location
	p12-7 - location
	p12-8 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s10)
	(at driver3 s12)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s11)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s8)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s9)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s11)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s12)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s10)
	(at package2 s2)
	(at package3 s12)
	(at package4 s11)
	(at package5 s12)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-10)
	(path p0-10 s0)
	(path s10 p0-10)
	(path p0-10 s10)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s2 p2-11)
	(path p2-11 s2)
	(path s11 p2-11)
	(path p2-11 s11)
	(path s3 p3-12)
	(path p3-12 s3)
	(path s12 p3-12)
	(path p3-12 s12)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(path s4 p4-12)
	(path p4-12 s4)
	(path s12 p4-12)
	(path p4-12 s12)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(path s10 p10-3)
	(path p10-3 s10)
	(path s3 p10-3)
	(path p10-3 s3)
	(path s10 p10-11)
	(path p10-11 s10)
	(path s11 p10-11)
	(path p10-11 s11)
	(path s11 p11-7)
	(path p11-7 s11)
	(path s7 p11-7)
	(path p11-7 s7)
	(path s12 p12-6)
	(path p12-6 s12)
	(path s6 p12-6)
	(path p12-6 s6)
	(path s12 p12-7)
	(path p12-7 s12)
	(path s7 p12-7)
	(path p12-7 s7)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 92)
	(= (time-to-drive s8 s0) 92)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 3)
	(= (time-to-drive s9 s0) 3)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 21)
	(= (time-to-drive s2 s1) 21)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 18)
	(= (time-to-drive s6 s1) 18)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 62)
	(= (time-to-drive s7 s1) 62)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 28)
	(= (time-to-drive s8 s1) 28)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 28)
	(= (time-to-drive s10 s1) 28)
	(link s1 s11)
	(link s11 s1)
	(= (time-to-drive s1 s11) 4)
	(= (time-to-drive s11 s1) 4)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 50)
	(= (time-to-drive s3 s2) 50)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 33)
	(= (time-to-drive s7 s2) 33)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 97)
	(= (time-to-drive s0 s3) 97)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 36)
	(= (time-to-drive s1 s3) 36)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 29)
	(= (time-to-drive s5 s3) 29)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 52)
	(= (time-to-drive s8 s3) 52)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 84)
	(= (time-to-drive s10 s3) 84)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 54)
	(= (time-to-drive s2 s4) 54)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 87)
	(= (time-to-drive s9 s4) 87)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 61)
	(= (time-to-drive s4 s5) 61)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 60)
	(= (time-to-drive s6 s5) 60)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 72)
	(= (time-to-drive s8 s5) 72)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 97)
	(= (time-to-drive s4 s6) 97)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 56)
	(= (time-to-drive s7 s6) 56)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 92)
	(= (time-to-drive s0 s7) 92)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 42)
	(= (time-to-drive s9 s7) 42)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 21)
	(= (time-to-drive s2 s8) 21)
	(link s8 s11)
	(link s11 s8)
	(= (time-to-drive s8 s11) 44)
	(= (time-to-drive s11 s8) 44)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 95)
	(= (time-to-drive s5 s10) 95)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 26)
	(= (time-to-drive s6 s10) 26)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 7)
	(= (time-to-drive s7 s10) 7)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 37)
	(= (time-to-drive s9 s10) 37)
	(link s11 s2)
	(link s2 s11)
	(= (time-to-drive s11 s2) 85)
	(= (time-to-drive s2 s11) 85)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 98)
	(= (time-to-drive s4 s11) 98)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 40)
	(= (time-to-drive s12 s11) 40)
	(link s12 s1)
	(link s1 s12)
	(= (time-to-drive s12 s1) 6)
	(= (time-to-drive s1 s12) 6)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 15)
	(= (time-to-drive s2 s12) 15)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 1)
	(= (time-to-drive s4 s12) 1)
	(link s12 s7)
	(link s7 s12)
	(= (time-to-drive s12 s7) 33)
	(= (time-to-drive s7 s12) 33)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s12)
	(at driver2 s4)
	(at driver3 s12)
	(at truck1 s4)
	(at truck3 s6)
	(at truck4 s12)
	(at truck5 s8)
	(at truck7 s6)
	(at truck8 s0)
	(at package1 s10)
	(at package2 s9)
	(at package3 s12)
	(at package4 s10)
	(at package5 s6)
	))

(:metric minimize (+ (* 2 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (load-truck package5 truck8 s12)
   deleted: (at package5 s12)
   added: (in package5 truck8)
   changed: (load truck8) from 0 to 1, (fuel-per-minute truck8) from 10 to 11
   goals met: 3 of 14
2. (walk driver2 s10 p10-3)
   deleted: (at driver2 s10)
   added: (at driver2 p10-3)
   goals met: 3 of 14
3. (walk driver1 s6 p12-6)
   deleted: (at driver1 s6)
   added: (at driver1 p12-6)
   goals met: 3 of 14
4. (board-truck driver3 truck8 s12)
   deleted: (at driver3 s12) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 2 of 14
5. (drive-truck truck8 s12 s11 driver3)
   deleted: (at truck8 s12)
   added: (at truck8 s11)
   changed: (fuel-used) from 0 to 440
   goals met: 2 of 14
6. (load-truck package4 truck8 s11)
   deleted: (at package4 s11)
   added: (in package4 truck8)
   changed: (load truck8) from 1 to 2, (fuel-per-minute truck8) from 11 to 13
   goals met: 2 of 14
7. (walk driver2 p10-3 s3)
   deleted: (at driver2 p10-3)
   added: (at driver2 s3)
   goals met: 2 of 14
8. (walk driver1 p12-6 s12)
   deleted: (at driver1 p12-6)
   added: (at driver1 s12)
   goals met: 3 of 14
9. (walk driver1 s12 p12-8)
   deleted: (at driver1 s12)
   added: (at driver1 p12-8)
   goals met: 2 of 14
10. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 14
11. (drive-truck truck1 s3 s5 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 440 to 730
   goals met: 2 of 14
12. (walk driver1 p12-8 s8)
   deleted: (at driver1 p12-8)
   added: (at driver1 s8)
   goals met: 2 of 14
13. (drive-truck truck8 s11 s4 driver3)
   deleted: (at truck8 s11)
   added: (at truck8 s4)
   changed: (fuel-used) from 730 to 2004
   goals met: 2 of 14
14. (drive-truck truck8 s4 s9 driver3)
   deleted: (at truck8 s4)
   added: (at truck8 s9)
   changed: (fuel-used) from 2004 to 3135
   goals met: 2 of 14
15. (drive-truck truck1 s5 s4 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (fuel-used) from 3135 to 3745
   goals met: 3 of 14
16. (drive-truck truck1 s4 s11 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s11)
   changed: (fuel-used) from 3745 to 4725
   goals met: 2 of 14
17. (drive-truck truck8 s9 s10 driver3)
   deleted: (at truck8 s9)
   added: (at truck8 s10)
   changed: (fuel-used) from 4725 to 5206
   goals met: 2 of 14
18. (unload-truck package4 truck8 s10)
   deleted: (in package4 truck8)
   added: (at package4 s10)
   changed: (load truck8) from 2 to 1, (fuel-per-minute truck8) from 13 to 11
   goals met: 3 of 14
19. (drive-truck truck8 s10 s6 driver3)
   deleted: (at truck8 s10)
   added: (at truck8 s6)
   changed: (fuel-used) from 5206 to 5492
   goals met: 3 of 14
20. (unload-truck package5 truck8 s6)
   deleted: (in package5 truck8)
   added: (at package5 s6)
   changed: (load truck8) from 1 to 0, (fuel-per-minute truck8) from 11 to 10
   goals met: 4 of 14
21. (drive-truck truck8 s6 s1 driver3)
   deleted: (at truck8 s6)
   added: (at truck8 s1)
   changed: (fuel-used) from 5492 to 5672
   goals met: 4 of 14
22. (board-truck driver1 truck3 s8)
   deleted: (at driver1 s8) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 14
23. (drive-truck truck3 s8 s11 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s11)
   changed: (fuel-used) from 5672 to 6112
   goals met: 4 of 14
24. (disembark-truck driver3 truck8 s1)
   deleted: (driving driver3 truck8)
   added: (at driver3 s1) (empty truck8)
   goals met: 4 of 14
25. (drive-truck truck1 s11 s2 driver2)
   deleted: (at truck1 s11)
   added: (at truck1 s2)
   changed: (fuel-used) from 6112 to 6962
   goals met: 4 of 14
26. (disembark-truck driver1 truck3 s11)
   deleted: (driving driver1 truck3)
   added: (at driver1 s11) (empty truck3)
   goals met: 4 of 14
27. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 14
28. (drive-truck truck1 s2 s4 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 6962 to 7556
   goals met: 5 of 14
29. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 5 of 14
30. (drive-truck truck1 s4 s9 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   changed: (fuel-used) from 7556 to 8513
   goals met: 4 of 14
31. (unload-truck package2 truck1 s9)
   deleted: (in package2 truck1)
   added: (at package2 s9)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 14
32. (drive-truck truck1 s9 s4 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (fuel-used) from 8513 to 9383
   goals met: 6 of 14
33. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 6 of 14
34. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 7 of 14
35. (board-truck driver3 truck8 s1)
   deleted: (at driver3 s1) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 7 of 14
36. (drive-truck truck8 s1 s12 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s12)
   changed: (fuel-used) from 9383 to 9443
   goals met: 7 of 14
37. (drive-truck truck8 s12 s7 driver3)
   deleted: (at truck8 s12)
   added: (at truck8 s7)
   changed: (fuel-used) from 9443 to 9773
   goals met: 7 of 14
38. (drive-truck truck8 s7 s0 driver3)
   deleted: (at truck8 s7)
   added: (at truck8 s0)
   changed: (fuel-used) from 9773 to 10693
   goals met: 8 of 14
39. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 7 of 14
40. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 7 of 14
41. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 7 of 14
42. (drive-truck truck4 s1 s12 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s12)
   changed: (fuel-used) from 10693 to 10753
   goals met: 8 of 14
43. (board-truck driver1 truck3 s11)
   deleted: (at driver1 s11) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 8 of 14
44. (drive-truck truck4 s12 s4 driver2)
   deleted: (at truck4 s12)
   added: (at truck4 s4)
   changed: (fuel-used) from 10753 to 10763
   goals met: 7 of 14
45. (drive-truck truck3 s11 s12 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s12)
   changed: (fuel-used) from 10763 to 11163
   goals met: 7 of 14
46. (drive-truck truck4 s4 s11 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s11)
   changed: (fuel-used) from 11163 to 12143
   goals met: 7 of 14
47. (disembark-truck driver1 truck3 s12)
   deleted: (driving driver1 truck3)
   added: (at driver1 s12) (empty truck3)
   goals met: 8 of 14
48. (disembark-truck driver2 truck4 s11)
   deleted: (driving driver2 truck4)
   added: (at driver2 s11) (empty truck4)
   goals met: 8 of 14
49. (board-truck driver2 truck7 s11)
   deleted: (at driver2 s11) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 8 of 14
50. (drive-truck truck7 s11 s4 driver2)
   deleted: (at truck7 s11)
   added: (at truck7 s4)
   changed: (fuel-used) from 12143 to 13123
   goals met: 8 of 14
51. (disembark-truck driver2 truck7 s4)
   deleted: (driving driver2 truck7)
   added: (at driver2 s4) (empty truck7)
   goals met: 9 of 14
52. (board-truck driver1 truck3 s12)
   deleted: (at driver1 s12) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 8 of 14
53. (drive-truck truck8 s0 s7 driver3)
   deleted: (at truck8 s0)
   added: (at truck8 s7)
   changed: (fuel-used) from 13123 to 14043
   goals met: 7 of 14
54. (drive-truck truck3 s12 s2 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s2)
   changed: (fuel-used) from 14043 to 14193
   goals met: 7 of 14
55. (walk driver2 s4 p4-11)
   deleted: (at driver2 s4)
   added: (at driver2 p4-11)
   goals met: 6 of 14
56. (walk driver2 p4-11 s11)
   deleted: (at driver2 p4-11)
   added: (at driver2 s11)
   goals met: 6 of 14
57. (board-truck driver2 truck4 s11)
   deleted: (at driver2 s11) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 6 of 14
58. (drive-truck truck4 s11 s4 driver2)
   deleted: (at truck4 s11)
   added: (at truck4 s4)
   changed: (fuel-used) from 14193 to 15173
   goals met: 6 of 14
59. (drive-truck truck8 s7 s12 driver3)
   deleted: (at truck8 s7)
   added: (at truck8 s12)
   changed: (fuel-used) from 15173 to 15503
   goals met: 6 of 14
60. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 15503 to 15713
   goals met: 6 of 14
61. (drive-truck truck3 s1 s6 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s6)
   changed: (fuel-used) from 15713 to 15893
   goals met: 7 of 14
62. (disembark-truck driver1 truck3 s6)
   deleted: (driving driver1 truck3)
   added: (at driver1 s6) (empty truck3)
   goals met: 7 of 14
63. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 8 of 14
64. (walk driver1 s6 p6-2)
   deleted: (at driver1 s6)
   added: (at driver1 p6-2)
   goals met: 8 of 14
65. (walk driver1 p6-2 s2)
   deleted: (at driver1 p6-2)
   added: (at driver1 s2)
   goals met: 8 of 14
66. (board-truck driver1 truck5 s2)
   deleted: (at driver1 s2) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 8 of 14
67. (drive-truck truck5 s2 s8 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s8)
   changed: (fuel-used) from 15893 to 16103
   goals met: 9 of 14
68. (disembark-truck driver1 truck5 s8)
   deleted: (driving driver1 truck5)
   added: (at driver1 s8) (empty truck5)
   goals met: 9 of 14
69. (walk driver1 s8 p12-8)
   deleted: (at driver1 s8)
   added: (at driver1 p12-8)
   goals met: 9 of 14
70. (walk driver1 p12-8 s12)
   deleted: (at driver1 p12-8)
   added: (at driver1 s12)
   goals met: 10 of 14
71. (disembark-truck driver3 truck8 s12)
   deleted: (driving driver3 truck8)
   added: (at driver3 s12) (empty truck8)
   goals met: 11 of 14
72. (board-truck driver1 truck8 s12)
   deleted: (at driver1 s12) (empty truck8)
   added: (driving driver1 truck8)
   goals met: 10 of 14
73. (board-truck driver2 truck4 s4)
   deleted: (at driver2 s4) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 9 of 14
74. (drive-truck truck4 s4 s12 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s12)
   changed: (fuel-used) from 16103 to 16113
   goals met: 10 of 14
75. (walk driver3 s12 p4-12)
   deleted: (at driver3 s12)
   added: (at driver3 p4-12)
   goals met: 9 of 14
76. (walk driver3 p4-12 s4)
   deleted: (at driver3 p4-12)
   added: (at driver3 s4)
   goals met: 9 of 14
77. (board-truck driver3 truck7 s4)
   deleted: (at driver3 s4) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 9 of 14
78. (drive-truck truck7 s4 s6 driver3)
   deleted: (at truck7 s4)
   added: (at truck7 s6)
   changed: (fuel-used) from 16113 to 17083
   goals met: 10 of 14
79. (disembark-truck driver3 truck7 s6)
   deleted: (driving driver3 truck7)
   added: (at driver3 s6) (empty truck7)
   goals met: 10 of 14
80. (disembark-truck driver1 truck8 s12)
   deleted: (driving driver1 truck8)
   added: (at driver1 s12) (empty truck8)
   goals met: 11 of 14
81. (disembark-truck driver2 truck4 s12)
   deleted: (driving driver2 truck4)
   added: (at driver2 s12) (empty truck4)
   goals met: 11 of 14
82. (board-truck driver2 truck8 s12)
   deleted: (at driver2 s12) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 11 of 14
83. (walk driver3 s6 p12-6)
   deleted: (at driver3 s6)
   added: (at driver3 p12-6)
   goals met: 11 of 14
84. (drive-truck truck8 s12 s4 driver2)
   deleted: (at truck8 s12)
   added: (at truck8 s4)
   changed: (fuel-used) from 17083 to 17093
   goals met: 11 of 14
85. (drive-truck truck8 s4 s9 driver2)
   deleted: (at truck8 s4)
   added: (at truck8 s9)
   changed: (fuel-used) from 17093 to 17963
   goals met: 11 of 14
86. (drive-truck truck8 s9 s0 driver2)
   deleted: (at truck8 s9)
   added: (at truck8 s0)
   changed: (fuel-used) from 17963 to 17993
   goals met: 12 of 14
87. (disembark-truck driver2 truck8 s0)
   deleted: (driving driver2 truck8)
   added: (at driver2 s0) (empty truck8)
   goals met: 12 of 14
88. (walk driver3 p12-6 s12)
   deleted: (at driver3 p12-6)
   added: (at driver3 s12)
   goals met: 13 of 14
89. (walk driver2 s0 p0-4)
   deleted: (at driver2 s0)
   added: (at driver2 p0-4)
   goals met: 13 of 14
90. (walk driver2 p0-4 s4)
   deleted: (at driver2 p0-4)
   added: (at driver2 s4)
   goals met: 14 of 14
